# Packages
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
brew "fzf"
brew "git"
brew "htop"
brew "ncdu"
brew "tmux"
brew "rsync"
brew "wget"
brew "pulumi"
brew "awscli"
brew "libpq"
brew "tree"
brew "eza"
brew "btop"
brew "lazygit"
brew "lazydocker"
brew "fastfetch"
brew "fd"
brew "ripgrep"
brew "neovim"
brew "gping"
brew "zsh", args: ["HEAD"]
brew "asimov", restart_service: true

# Casks
cask "kitty"
cask "docker"
cask "slack"
cask "intellij-idea"
# Menubar cpu/memory stats
cask "stats"
# Clipboard manager
cask "maccy"
cask "1password"
cask "coconutbattery"
cask "hammerspoon"
cask "numi"
cask "spotify"
cask "zoom"
cask "google-drive"
cask "obsidian"
cask "vlc"
cask "signal"
cask "appcleaner"
# Emoji finder
cask "rocket"
cask "whatsapp"
cask "chatgpt"
cask "postman"
cask "miro"
cask "firefox@developer-edition"
